IDC_GUCCO_FRAME_MATERIAL                      = "Material"
IDC_GUCCO_LABEL_MATERIAL_FCK                  = "Concrete"
IDC_GUCCO_LABEL_MATERIAL_MB                   = "Main Bar"
IDC_GUCCO_LABEL_MATERIAL_HB                   = "Hoop Bar"
IDC_GUCCO_LABEL_HBEAM                         = "H-Beam"
IDC_GUCCO_LABEL_STUD                          = "Stud"
IDC_GUCCO_FRAME_SHAPE                         = "Shape"
IDC_GUCCO_RADIO_SHAPE_RECT                    = "Rectangular"
IDC_GUCCO_RADIO_SHAPE_CIRCLE                  = "Circle"
IDC_GUCCO_FRAME_SECTION                       = "Section"
IDC_GUCCO_LABEL_SECTION_WIDTH                 = "Width"
IDC_GUCCO_LABEL_SECTION_HEIGHT                = "Height"
IDC_GUCCO_LABEL_SECTION_LENGTH_X              = "Length(x)"
IDC_GUCCO_LABEL_SECTION_LENGTH_Y              = "Length(y)"
IDC_GUCCO_LABEL_SECTION_KFACTOR_X             = "Kx"
IDC_GUCCO_LABEL_SECTION_KFACTOR_Y             = "Ky"
IDC_GUCCO_FRAME_HBEAM                         = "H-Beam"

//IDD_SRC_COLUMN_INPUT_DLG
IDC_GUCCO_FRAME_FORCE                         = "Force && Moment"
IDC_GUCCO_LABEL_FORCE_AXF                     = "Axial"
IDC_GUCCO_LABEL_FORCE_MEMX                    = "Moment(x)"
IDC_GUCCO_LABEL_FORCE_MEMY                    = "Moment(y)"
IDC_GUCCO_LABEL_FORCE_SHX                     = "Shear(x)"
IDC_GUCCO_LABEL_FORCE_SHY                     = "Shear(y)"
IDC_GUCCO_FRAME_COE                           = "Coefficient / Factor"
IDC_GUCCO_LABEL_COE_CMX                       = "Cmx"
IDC_GUCCO_LABEL_COE_CMY                       = "Cmy"
IDC_GUCCO_LABEL_COE_BETAD                     = "βd"
IDC_GUCCO_INPUT_BTN_LCOMB                     = "Load Combinations ..."
IDC_GUCCO_FRAME_SPLICE                        = "Spacing Limit of Main Rebar"
IDC_GUCCO_FRAME_ARRANGE                       = "Rebar && Steel Arrangement"
IDC_GUCCO_FRAME_REBAR                         = "Rebar"
IDC_GUCCO_FRAME_MBAR                          = "Main Bar Arrangement"
IDC_GUCCO_RADIO_REBAR_ALIGN_AUTO_CORNER       = "Corner ( Auto Calc )"
IDC_GUCCO_RADIO_REBAR_ALIGN_AUTO_UNIFORM      = "Identically Distribute"
IDC_GUCCO_RADIO_REBAR_ALIGN_USER              = "Corner ( by User :"
IDC_GUCCO_CHK_LOADTR                          = "Check Load Transfer"
IDC_GUCCO_LABEL_LOADTRANSMISSON_CASE1         = "External force to steel only"
IDC_GUCCO_LABEL_LOADTRANSMISSON_CASE2         = "External force to concrete only"
IDC_GUCCO_LABEL_LOADTRANSMISSON_CASE3         = "External force to Both materials concurrently"
IDC_GUCCO_FRAME_STUD                          = "Headed Stud"
IDC_GUCCO_LABEL_STUD_TYPE                     = "Type"
IDC_GUCCO_LABEL_STUD_SPACE                    = "Space"
IDC_GUCCO_LABEL_STUD_LENGTH                   = "Length"
IDC_GUCCO_LABEL_STUD_NO_WEB                   = "No. ( Web )"
IDC_GUCCO_LABEL_STUD_NO_FLG                   = "No. ( Flg )"
IDC_GUCCO_LABEL_STUD_WEB                      = "Web"
IDC_GUCCO_LABEL_STUD_FLG                      = "Flg."
IDC_GUCCO_RADIO_SPLICE000                     = "Do not splice"
IDC_GUCCO_RADIO_SPLICE050                     = "50%"
IDC_GUCCO_RADIO_SPLICE100                     = "100%"
IDC_GUCCO_FRAME_PM_CURVE                      = "PM Interaction Curve"
IDC_GUCCO_FRAME_RESULT                        = "Calculation Result"
IDC_GUCCO_LABEL_STUD_WEB2                     = "EA"
IDC_GUCCO_LABEL_STUD_FLG2                     = "EA"
IDC_GUCCO_LABEL_REBAR_ALIGN_USER              = ")"

//IDD_SRC_COLUMN_SMODE_INPUT_SECT2_DLG
IDC_GUCCO_LABEL_UNIT2                         = "Unit :"
IDC_GUCCO_LABEL_UNIT                          = "Unit"
IDC_GUCCO_LABEL_LOADTR                        = "External force to"
IDC_GUCCO_LABEL_EXTEND                        = "Member extends to"
IDC_GUCCO_LABEL_FORCE_EXT                     = "External force"
IDC_GUCCO_LABEL_TR_REGION                     = "Transfer Region"
IDC_GUCCO_CHECK_REBAR_SPACE_AUTO              = "Auto calc."
IDC_GUCCO_CHECK_REBAR_SPACE_AUTO_SPACE        = "Space"

//IDD_SRC_COMP_BEAM_FORC_DLG
IDD_SRC_COMP_BEAM_FORC_DLG                    = "Concentrated Force"
IDC_SRC_COMPOSITE_BEAM_LIST_FORCE_SELECT_MEMB  = "Select Member"
IDC_SRC_LIST_FORCE_SELECT_BTN_ALL             = "All"
IDC_SRC_LIST_FORCE_SELECT_BTN_NONE            = "None"
IDC_SRC_COMPOSITE_BEAM_LIST_FORCE_CONCENTRATED_FORCE  = "Concentrated Force"
IDC_SRC_LIST_FORCE_BTN_APPLY                  = "Apply"
IDC_SRC_LIST_FORCE_BTN_CANCEL                 = "Cancel"

// IDD_SRC_UCFT_PMODE_DLG
IDC_GUCFT_MATERIAL_GRP                        = "Material"
IDC_GUCFT_MATL_STC                            = "Steel"
IDC_GUCFT_CONC_STC                            = "Concrete"
IDC_GUCFT_SECTION_GRP                         = "Section"
IDC_GUCFT_FORCE_GRP                           = "Force"
IDC_GUCFT_AXIAL_STC                           = "Axial"
IDC_GUCFT_MX_STC                              = "Moment (x)"
IDC_GUCFT_MY_STC                              = "Moment (y)"
IDC_GUCFT_VX_STC                              = "Shear (x)"
IDC_GUCFT_VY_STC                              = "Shear (y)"
IDC_GUCFT_LENGTH_GRP                          = "Length"
IDC_GUCFT_LX_STC                              = "Lx"
IDC_GUCFT_LY_STC                              = "Ly"
IDC_GUCFT_KX_STC                              = "Kx"
IDC_GUCFT_KY_STC                              = "Ky"
IDC_GUCFT_LV_STC                              = "Lv"
IDC_GUCFT_LOADTR_CHK                          = "Check Load Transfer"
IDC_GUCFT_EXT_FORCE_STC                       = "External force to"
IDC_GUCFT_CFT_EXTEND_STC                      = "CFT member extends to"
IDC_GUCFT_CALC_RESULT_GRP                     = "Calculation Result"
IDC_GUCFT_INPUT_BTN_LCOMB                     = "Load Combinations ..."
IDC_GUCFT_CHECK_SEISMIC_PROVISIONS            = "Apply Special Provision"
IDC_GUCFT_RADIO_HIGH_DUCTILITY                = "High Ductility"
IDC_GUCFT_RADIO_MIDDLE_DUCTILITY              = "Middle Ductility"

/////// IDD_SRC_COMP_BEAM_PMODE_DLG
IDC_GUCCB_FRAME_MATERIAL                      = "Material"
IDC_GUCCB_LABEL_HBEAM                         = "H-Beam"
IDC_GUCCB_LABEL_STUD                          = "Stud"
IDC_GUCCB_LABEL_SHEARCON                      = "Shear Connector"
IDC_GUCCB_LABEL_MATERIAL_FCK                  = "Concrete"
IDC_GUCCB_FRAME_SECTION                       = "Section"
IDC_GUCCB_FRAME_SLAB                          = "Slab"
IDC_GUCCB_LABEL_SLAB_THIC                     = "Thickness"
IDC_GUCCB_FRAME_SHAPE_TYPE                    = "Shape"
IDC_GUCCB_RADIO_STYPE_T                       = "T-Shape"
IDC_GUCCB_RADIO_STYPE_HALF_T                  = "Half T-Shape"
IDC_GUCCB_FRAME_DECKPLATE                     = "Deck Plate"
IDC_GUCCB_FRAME_SHEAR_CON_TYPE                = "Shear Connector"
IDC_GUCCB_RADIO_STUD                          = "Headed Stud"
IDC_GUCCB_RADIO_CHANNEL                       = "Channel"
IDC_GUCCB_FRAME_STUD                          = "Headed Stud"
IDC_GUCCB_LABEL_STUD_TYPE                     = "Type"
IDC_GUCCB_LABEL_STUD_COLUMN                   = "Columns"
IDC_GUCCB_LABEL_STUD_SPACE                    = "Spacing"
IDC_GUCCB_LABEL_STUD_LENGTH                   = "Length"
IDC_GUCCB_LABEL_CHANNEL_NUM                   = "Number"
IDC_GUCCB_LABEL_CHANNEL_SPACE                 = "Spacing"
IDC_GUCCB_LABEL_CHANNEL_WIDTH                 = "Width"
IDC_GUCCB_RADIO_DRAW_SECT                     = "Section View"
IDC_GUCCB_RADIO_DRAW_VIBR                     = "Vibration Chart"
IDC_GUCCB_FRAME_SPAN                          = "Span && Support"
IDC_GUCCB_CHK_SPAN_SUPPORT                    = "Use Support"
IDC_GUCCB_LABEL_SPAN_SPAN                     = "Span"
IDC_GUCCB_LABEL_SPAN_SPACE                    = "Spacing"
IDC_GUCCB_LABEL_SPAN_UNBRACE                  = "Unbraced Length"
IDC_GUCCB_FRAME_DLOAD                         = "Design Load"
IDC_GUCCB_LABEL_DLOAD_LL                      = "Live Load"
IDC_GUCCB_LABEL_DLOAD_FL                      = "Finishing Load"
IDC_GUCCB_LABEL_DLOAD_CL                      = "Construction Load"
IDC_GUCCB_CHK_DLOAD_SELF                      = "Consider Self Weight"
IDC_GUCCB_CHK_DLOAD_CONCENTRATE               = "Consider Concentrated Load"
IDC_GUCCB_FRAME_DEFLECT                       = "Criteria for Deflection"
IDC_GUCCB_LABEL_DEFLECTION_CONST              = "During Construction"
IDC_GUCCB_LABEL_DEFLECTION_LIVE               = "By Live Load"
IDC_GUCCB_LABEL_DEFLECTION_SPAN_LIVE          = "Span /"
IDC_GUCCB_LABEL_DEFLECTION_ALL                = "By Dead && Live Load"
IDC_GUCCB_LABEL_DEFLECTION_SPAN_ALL           = "Span /"
IDC_GUCCB_FRAME_VIBR                          = "Vibration"
IDC_GUCCB_LABEL_VIBR_LOAD                     = "Load Factor"
IDC_GUCCB_LABEL_VIBR_TYPE                     = "Use Type"
IDC_GUCCB_LABEL_VIBR_BETA                     = "Damp. Ratio (β)"
IDC_GUCCB_FRAME_VIBR_SECT                     = "Girder Section"
IDC_GUCCB_CHK_VIBR_GIRD                       = "Consider Girder Mode"
IDC_GUCCB_LABEL_VIBR_SPAN                     = "Girder Span"
IDC_GUCCB_LABEL_VIBR_POSITION                 = "Pos. of Girder"
IDC_GUCCB_LABEL_VIBR_CONN                     = "Conn. Type"
IDC_GUCCB_FRAME_VIBR_GIRD_SECT                = "Girder Section"
IDC_GUCCB_FRAME_PROPERTY                      = "Section Property"
IDC_GUCCB_FRAME_RESULT                        = "Calculation Result"
